//for 循环
// 打印1-10之间所有的整数
// 初始值,循环条件,增量
for(var i=1;i<=10;i++){
    // console.log(i);
}


// 80 75 70 65 60
for(var i=80;i>=60;i-=5){
    // console.log(i);
}

//1-100所有奇数的和
var sum=0;//1+3+5...
for(var i=1;i<=100;i++){
   if(i%2===1){
   sum+=i;
   }
}
// console.log(sum);

// 1-20之间能被3整除的乘积
var sum=1;
for(var i=1;i<=20;i++){
    if(i%3===0){
    sum*=i;
    }
}
// console.log(sum);


// 练习 4年一闰 ，能被4整除，
// 并且不能被100整除不是闰年，能被400整除是闰年
for(var i=2000;i<=2100;i++){
    // i代表所有的年份
    // 判断年份是否为闰年
    if(i%4===0 && i%100!==0 || i%400===0){
        // console.log(i);
    }
}

// 99乘法表
var str='';//''+1+2+3->'123'
for(var i=1;i<=3;i++){
    // 把每次产生的值i,加号拼接到str中  ' '空格
    // str空字符拼接i,i<=3,然后+再拼接*3,最后拼接i*3的值,+上字符串空格隔开+' '.
    str+=i+'*3='+(i*3)+' ';
    // 1*3=3 2*3=6 3*3=9 
}
console.log(str);

// 99乘法表第五行
// var str='';
for(var i=1,str='';i<=5;i++){//for声明多个变量
    // 把每次产生的值i,加号拼接到str中  ' '空格
    // str空字符拼接i,i<=3,然后+再拼接*3,最后拼接i*3的值,+上字符串空格隔开+' '.
    str+=i+'*5='+(i*5)+' ';
    // 1*3=3 2*3=6 3*3=9 
}