// 2000-2100前10个闰年
for(var i=2000,sum=0;i<=2100;i++){
    if(i%4===0 && i%100!==0 || i%400===0){
        // 如果是闰年，sum的值加1
        sum++;//25个闰年
        // console.log(i);
        // 判断闰年的个数sum是否为10
        // 如果是，就提前结束
        if(sum===10){
            break;
        }
    }
}
// console.log(sum);

// 1-100所有整数的和，大于4000结束，打印当前的和
for(var i=1,sum=0;i<=100;i++){
    sum+=i;
    if(sum>=4000){
    break;
        }
    }
    // console.log(sum,i);

    // 99乘法表
    // 外层循环：控制循环的行数
    // i代表行号
    for(var i=1;i<=9;i++){
    // 内层循环,控制每一行的个数
    // ***
    for(var j=1,str='';j<=i;j++){
        // 每次拼接1个*
        str+='*';
    }
    console.log(str);
    }


        // 99乘法表
    // 外层循环：控制循环的行数
    // i代表行号
    for(var i=1;i<=9;i++){
        // 内层循环,控制每一行的个数
        // j代表列号
        for(var j=1,str=' ';j<=i;j++){
            // 每次拼接1个*
            str+=j+'*'+i+'=';
            // j代表列号，先拼接上j,然后加号拼接乘号'*',拼接行号i，行号和列号开始相乘,拼接等号'='，再拼接行和列相乘的结果(j*i).最后空格 
            str+= j+'*'+i +'=' +(j*i) +' ';
        }
        console.log(str);
        }
